app/controllers/meeting_controller.rb

  def show
    @meeting = Meeting.find(params[:id])
---
SELECT * FROM "meetings" WHERE ("meetings"."id" = 100)

  def register
    @meeting = Meeting.find(params[:id])
    @title = @meeting.name

    @athlet = Athlete.create(params[:athlete])
    return render :action => :show if @athlet.invalid?

    @athlet.meeting = @meeting
    @athlet.save!
---
INSERT INTO "athletes" ("name", "age_group", "club", "city", "meeting_id", "created_at", "postal_code", "license", "updated_at", "street", "sex", "surname") VALUES('cZXZxctsra', 1994, 'Verein', 'PLZ / Ort', NULL, '2010-04-19 04:54:25', NULL, 'Lizenz', '2010-04-19 04:54:25', 'Strasse', NULL, 'Vorname')
INSERT INTO "meetings" ("name", "created_at", "updated_at", "date") VALUES('arst', '2010-04-19 04:26:27', '2010-04-19 04:26:27', '2010-04-19 04:26:24')

  def export
    @meeting = Meeting.find(params[:id])
---
SELECT * FROM "meetings" WHERE ("meetings"."id" = 1)