app/controllers/session_controller.rb

  def index
    @meetings = Meeting.all(:conditions => [ "anmeldeschluss > ?", Time.now ], :order => :datum)
---
SELECT * FROM "meetings"